[
	{
	  "position": "Software Developer",
	  "company": "Dollop Digital",
	  "type": "Part Time",
	  "location": "Queensland, Australia (Remote)",
	  "duration": "2024 Sep - Present",
	  "description": "Refactored and modernized legacy Java codebases, transitioning applications from Java 8 to Java 17 to enhance performance, maintainability, and security. Collaborated on backend services using Spring Boot, Spring Data JPA, and RESTful APIs to improve system scalability and reliability. Participated in peer code reviews and implemented unit tests using JUnit 5, ensuring stable releases and high test coverage in an Agile remote development environment.",
	  "skills": ["Java", "Spring Boot", "REST API", "JUnit", "Code Reviews"]
	},
	{
	  "position": "Software Developer",
	  "company": "Green Hub",
	  "type": "Full Time",
	  "location": "Kathmandu, Nepal (Hybrid)",
	  "duration": "2021 - 2023",
	  "description": "Worked in a Java backend team using Java 8/11, Spring Boot, Hibernate, and MySQL. Designed secure, efficient RESTful APIs and applied key design patterns such as Strategy, Builder, and Observer to support modular, event-driven features. Integrated DTOs, input validation, and centralized exception handling using Spring’s @ControllerAdvice. Achieved over 85% test coverage on critical modules and automated CI/CD pipelines using Maven, Jenkins, GitHub Actions, and AWS (EC2, S3), cutting manual release time by 30%.",
	  "skills": ["Java", "Spring Boot", "Hibernate", "REST API", "JUnit", "Maven", "GitHub Actions", "AWS"]
	},
	{
	  "position": "Freelance Software Developer",
	  "company": "Upwork",
	  "type": "Part Time",
	  "location": "Freelance",
	  "duration": "2022 - 2023",
	  "description": "Completed 20+ custom software projects for international clients, start-ups, and SMEs across diverse industries with a 100% satisfaction rate. Designed and delivered Java-based RESTful APIs, reducing response times by up to 25%. Developed 5+ payment integration plugins to streamline online transactions for platforms with over 30,000 users. Provided personalized tutoring on Java programming and the Spring Framework, enabling clients to deepen technical skills and enhance project delivery capabilities.",
	  "skills": ["Java", "Spring Boot", "Hibernate", "REST API", "Tutoring", "Payment Integration"]
	}
]
  